Repository: mozilla-l10n/mt-training-data
Catalog: hno/hno_pontoon.tmx
Source language: en_us
Languages: hno

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
hno: اسیں اک آوازاں دے اوپن سورس ڈیٹا سیٹ کو کراؤڈ سورس کردے ہاں۔ اپنڑی آواز دا عطیہ کرو، دوسرے لوگاں دے کلپس دی درست ہونڑا دی تصدیق کرو، ڈیٹا سیٹ کو ہر اک واسطے بہتر بڑاؤ۔

source: We’re experiencing unexpected downtime
hno: اسیں غیر متوقع وقفے دا سامنڑا کر رہیے ہاں

source: We're going out to get coffee.
hno: اسیں کافی گھننا واسطے باہر جلدے ہاں۔

source: We’re going out to get coffee.
hno: اسیں کافی گھننا واسطے باہر جَا رِہ ہاں۔

source: We release the dataset every 3 months.
hno: اسیں ہر تیسرے مہینےڈیٹا سیٹ جاری کردے ہاں۔

source: We're making some big changes
hno: اسیں کوئی بڑی تبدیلیاں کر رے آں

source: We're receiving a lot of traffic and are currently investigating the issues.
hno: اسیں بہت ساری ٹریفک وصول کر رہیے ہاں تے مسلیاں دی چھان بین کر رہیے ہاں۔

source: We’re sorry, your platform is not currently supported.
hno: اسیں معذرت خواہ ہاں، اس وقت تسدا پلیٹ فارم تعاون نیں کردا۔

source: Western Highland Purepecha
hno: مغربی ہاٸلینڈ پیورپیچہ

source: Western Penan
hno: ویسٹرن پینان

source: Western Sierra Puebla Nahuatl
hno: مغربی سیرا پیوبلا ناہوٹل

source: Westphalian
hno: ویسٹ پھالی

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
hno: اسیں ترجمے واسطے ہک موزیلا ٹول استعمال کردے ہاں جسکو <pontoonLink>پونٹون</pontoonLink>آکھدے ہن۔ پونٹون دیاں مچ ساریاں زباناں ہن، اگر اس کول تسدی نیں تے تسیں <pontoonRequestLink>اپنڑی زبان شامل کرنا دی درخواست کر ھکدے ہو</pontoonRequestLink>۔ فر، زبان کو کامن وائس پروجیکٹ تے دستیاب ہونڑا واسطے، <githubRepoLink> GitHub تے نئ زبان دے درخواست کرو</githubRepoLink>۔ <localizationFragment>سائٹ ترجمے تے ہور دکھو</localizationFragment>۔

source: We’ve made some changes. Delta Segments just contain the most recent clips since the last release. <deltaLink>Read more about this work</deltaLink>.
hno: اساں کوئی تبدیلیاں کیتاں دیاں ہن۔ ڈیلٹا سیگمنٹس بچ صرف حالیہ کلپس ہن جدوں تو آخری ریلیز ہوئی۔ <deltaLink>اس کم دے بارے ہور پڑھو</deltaLink>۔

source: We've run out of sentences to record in this language...
hno: اساں کول اس زبان بچ ریکارڈ کرنا واسطے جملے مُک گئے ہن۔۔۔۔

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
hno: اسیں او سپیچ ماڈلز چہندے ہاں جڑے مختلف قسم دے بولنا والیاں کو سمجھنے بچ ہہتر ہوََن۔ اے ہونڑا واسطے، ہک آواز دے ڈیٹا سیٹ ضرور مچ سارے مختلف قسم دے لوگاں دی نمائندگی کرا۔

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
hno: اسیں چہندے اں مشین لرننگ الگورتھم مختلف قسم دے پس منظر دے شور کو ہینڈل کرنا دے قابل ہوے، تے اگر نسبتاََ تیز آوازاں کو بھی قبول کر ہکا بشرط کہ او تساں کو مکمل ٹیکسٹ سنڑنا تو نہ روکا۔ پرسکون پس منظر دے گانڑیں ٹھیک ہن؛ گانڑیں اتنے اُچے جیڑے تساں کو ہر اک لفظ سنڑنا تو روکن (ٹھیک) نیں۔

source: We welcome different accents! Be very cautious before rejecting a clip on the ground that you think the reader has mispronounced a word, has put the stress in the wrong place, or has ignored punctuation. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a generous margin of appreciation for those who may speak differently from you.
hno: اسیں مختلف لہجیاں دا استقبال کردے ہاں! ہک کلپ مسترد کرنا تو پہلا محتاط رہیو اس بنیاد تے کہ پڑھنا والے سنڑ ہک لفظ دا تلفظ غلط کیتاہے، غلط جگہ تے سڑیس کیتا ہے، یا علامتاں کو نظر انداز کیتا ہے۔ دنیا بھر استعمال بچ تلفظ بہت ساری طرح دے ہن، جنہاں بچو کوئی تساں اپنڑی مقامی کمیونٹی بچ نہ سُنڑے ہوسن۔ براہ مہربانی قدردانی دا ہک خاصا فرق فراہم کرو انہاں لوگاں کو جڑے تساں کولو مختلف بولدے ہوسن۔

source: We will also <strong>let our community manager know that you’re interested</strong>, so they can give you any extra support or information you might need.
hno: اسیں<strong>اپبڑیں کمیونٹی منیجر کو بھی دسّاں کہ تسدی دلچسپی ہے</strong>، تاکہ او تساں کو کوئی مزید مدد یا معلومات جڑّی چائی دے ہوّا او دیون۔

source: We will be in touch with more information about how to add your language to Common Voice very soon.
hno: تسدی زبان کو مچ جلدی کہیان کامن وائس بچ شامل کراں، اسیں اس بارے مزید معلومات نال رابطے بچ رہساں۔

source: We will be in touch with more information as it becomes available.
hno: اسیں مزید معلومات جیاں ہی ملدی ہے تّساں نال رابطے بچ رہساں۔

source: We will not make your email public.
hno: اسیں تسدی ای میل کو عوامی نہ کرساں۔

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
hno: اسیں ڈیٹا سیٹ بچو تُسدی وائس ریکاڈنگ کڈنا دی گزارش دا جائزہ گھنساں۔ اگر گزارش قبول ہو جلدی ہے، اسیں اُناں نال رابطہ کرساں جِناں سنڑ ڈیٹا سیٹ ڈاؤنلوڈ کیتا دا ہے ہور گزارش کرساں کہ او بھی تُسدی وائس ریکاڈنگ مُکا چُھڑن۔

source: We will show you a prompt or question
hno: تساں اسیں ہک پرامپٹ یا سوال دسسّاں

source: We work with foundations, civil society and community partners to make the internet a healthier place, with a particular focus on East Africa. Learn more about our <programmaticWork>programmatic work.</programmaticWork>
hno: اسیں فلاحی اداریاں، سول سوسائٹی تے کمیونٹی حصہ داراں نال مل کے انٹرنیٹ کو صحت مند بنڑانڑا آستے کم کردے ہاں، خاص طور تے مشرقی افریقہ آستے۔ اسدے <programmaticWork>پروگراماں دے کم</programmaticWork> بارے مزید سکھو۔

source: What is a language on Common Voice?
hno: کامن وائس تے کِڑی زبان ہے؟

source: What issues are you experiencing with this content?
hno: اس متن نال تسیں کِڑّے مَسلیاں دا سامنڑا کر رہ ہو؟

source: What issues are you experiencing with this sentence?
hno: اس جملے نال تسیں کِڑے مَسلیاں دا سامنڑا کر رہ ہو؟

source: What is your age?
hno: تسدی عمر کے اے؟

source: What is your sex or gender?
hno: تسدی جنس یا صنف کے اے؟

source: What kind of goal do you want to build?
hno: تسیں کس قسم دا مقصد بنڑینڑا چاہ رے ہو؟

source: What needs to be in my file?
hno: مڑی فائلا بچ کہ ہونڑا چاہی دا ہے؟

source: What questions can I add?
hno: کس طرح دے سوال میں بھا ہکداں؟

source: What sentences can I add?
hno: کیڑے جملے میں بھا ہکدا ہاں؟

source: What’s inside the Common Voice dataset?
hno: کامن وائس ڈیٹا سیٹ دے اندر کے ہے؟

source: What's Public?
hno: عوامی کے ہے؟

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
hno: جدوں ہک استعمال کرنڑ والا آواز دے کلپ کو مسترد کردا ہے تو اُو واپس لینڑا بچ آ جلدا ہے۔ اگر دوسری دفعہ مسترد ہو جُلے، تے اُس آواز دے کلپ کو کلب قبرستان بچ منتقل کر چُھڑدے ہن۔

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
hno: جدوں سنڑو، بڑی احتیاط نال چیک کرو کہ جڑا ریکارڈ کیتا دیا ہے او واقعی اوہی جڑا لکھیا دا ہے؛ اگر معمولی جی غلطی بھی ہووا تے رد کرو۔ <br />مچ عام غلطیاں بچ شامل ہن:

source: When you request your recordings, we compile them into one or multiple ZIP files. Here are your past requests:
hno: جدوں تسیں اپنڑیاں ریکاڈنگاں دی درخواست دیندے ہو، اسیں اُناں کو ہک یا زیادہ ZIP فائلاں بچ مرتب کردے ہاں۔ تُسدیاں پہلا دی درخواستاں اے ہن:

source: Which variant of { $language } do you speak?
hno: تسیں{ $language } دی کِڑّی ورائٹی بُولدے او؟

source: Why ?
hno: کیاں؟

source: Why a profile?
hno: ہک پروفائل کیاں؟

source: Why are you asking?
hno: تسیں کِیاں پُچھدے ہو؟

source: Why Common Voice?
hno: کامن وائس کیاں؟

source: Why does this matter?
hno: اے اہم کیّاں ہے؟

source: Why we built this Spontaneous Speech prototype
hno: اسیں اس بےساختہ تقریر دا پروٹوٹائپ کیّاں بنڑا رہیاں

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
hno: پروفائل نال تسیں آپنڑی سرگرمی تے نظر رکھ سکدے ہو ہور وائس ڈیٹا کنڑیبوٹر دی برادری نال جُڑ سکدے ہو۔

source: Wixarika
hno: وکساریکا

source: Wixárika
hno: ویزاریکا

source: Wolof
hno: وُلوف

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
hno: تُسیں اپنڑی وائس ریکاڈنگ کو ڈیلیٹ کرنا ریکوسٹ کرنا چہندے ہو، یا تُسیں چہندے ہو کہ اے کامن وائس ڈیٹا سیٹ بچ رہون؟

source: Write
hno: لِکھو

source: Write down exactly what the person said, including placeholder words like 'um', or 'errr'.
hno: بلکل اُئی لکھو جڑّا کسی آخیا دا اے، پلیس ہولڈر لفظ جسطرح 'um' یا 'errr' نال ای

source: Write down what you hear the person saying here
hno: لکھو جِڑا تُساں اس آدمیاں کو اِتھا آخدیاں سنڑیا

source: Write options menu
hno: اختیارات آلے مینو کو لکھو

source: Xhosa
hno: ہوسا

source: Xitsonga
hno: چٹ سونگا

source: y
hno: ہاں

source: Y
hno: ہاں

source: Yaqui
hno: یاقوی

source: Yes
hno: ہاں

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
hno: ٹھیک ہے، مکو ای میلاں جولو۔ میں کامن وائس پروگرام دے حوالے نال باخبر رہنڑا چہنداں۔

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
hno: ہاں، مکّو ای میلاں جولو۔ میں کامن وائس تے اس زبان دی پیش رفت بارے باخبر رہنڑا چہنداں۔

source: Yiddish
hno: یدش

source: Yoruba
hno: یوروبا

source: You
hno: تسیں

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
hno: تسیں <size>{ $size }GB</size>دا ڈاؤنلوڈ شروع کرن لگے ہو، اگاں جُلاں؟

source: You are prepared to initiate a download of <b>{ $size }</b>
hno: تسیں <b>{ $size }</b>کو ڈاؤن لوڈ شروع کرنا واسطے تیار ہو

source: You can add sentences on the <writePageLink>Write page</writePageLink> or review sentences on the <reviewPageLink>Review page</reviewPageLink>.
hno: تسیں جملے <writePageLink>لکھنڑا دے صفحے</writePageLink>تے بہّ ہکدے ہو یا جملے <reviewPageLink>ریویو صفحے</reviewPageLink> تے دوبارہ دکھ ہکدے ہو۔

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
hno: تسیس اپنڑے پسند دے ڈاؤنلوڈ مینیجر بچ سدھا URLs کو کاپی تے پیسٹ بھی کر سکدے او۔ اُنہاں دی میعاد 12 گھنٹیاں بچ مُک جُلسی، لیکن تسیں کسی بھی وقت نواں بنڑیڑاں کیتے اس صفحے تے واپس آ ہکدے او۔

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
hno: تسں کی بورڈ شارٹ کٹ بھی استعمال کر سکدے ہو:{ sc-review-form-button-approve-shortcut }منظور کرنا واسطے،{ sc-review-form-button-reject-shortcut }مسترد کرنا واسطے،{ sc-review-form-button-skip-shortcut }چھوڑنا واسطے

source: You can choose to make your username public or anonymous.
hno: تُسیں اپنڑے استعمال دے ناں کو عوامی یا چُھپیا دا رکھنڑا چُنڑ سکدے ہو۔

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
hno: تسیں<datasetsPage>ڈیٹاسیٹ ورقے</datasetsPage>تے پہنچ سکدے او، اپنڑی مرضی دے ورژن تے زبان (زباناں) دا انتخاب کر سکدے او، نال اسکو ڈاؤن لوڈ بھی کر سکدے او! فائلاں بچ<metadataLink>متعلقہ میٹا ڈیٹا</metadataLink>ہے۔ جیسطرح کہ آبادی دے متعلق معلومات ہور توثیق دا ڈیٹاہے۔ ڈیٹاسیٹ ڈاؤنلوڈ کرنا واسطے تساں کو ہک ای میل پتہ دینڑا ہوسی۔

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
hno: کامن وائس پروفائل بنڑا کے ہور اپنڑی آواز دا عطیہ کر کے تُسیں ہک متنوع، اوپن-سورس ڈیٹا سیٹ بڑینڑا بچ مدد کر سکدے ہو۔

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
hno: تسیں موزیلا لیگویچ کمیونٹیز بچ دویاں کو مل سکدے ہو،موضوعی گفتگو تے <discourseLink>ڈسکورس</discourseLink> بچ شامل ہو کے، یا<matrixLink>میٹرکس</matrixLink>تے فوری مشورے واسطے۔

source: You cannot add multiple sentences for a single submission
hno: تسیں ہک سبمشن واسطے مختلف طرح دے جملے نیں شامل کر سکدے ہو

source: You cannot request your recordings while another request is already in progress.
hno: تسیں آپنڑی ریکاڈنگ دی گزارش نیں کر سکدے جدوں ہک ہور گزارش پہلے ہی جاری ہے۔

source: You can request a new takeout of your recordings every { $days } days.
hno: تسیں ہر{ $days } دیہاڑے بچ آپنڑی ریکاڈنگ دی نویں ٹیک آؤٹ دی گزارش کر سکدے ہو۔

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
hno: تسیں لوگاں دی مدد واسطے ایونٹس چلا سکدے ہو تاکہ او تعاون کرن۔ اے تسدے خیال کولو بھی آسان ہے۔ ایہ تسیں وڈیو کانفرنسنگ ٹول دے ذریعے آن لائن بھی کر سکدے ہو، یا ذاتی طور تے ایہ اگر محفوظ ہے۔ <eventTemplate>ایونٹس چلانڑا واسطے اسدیاں مثالاں تے وسائل چیک کرو</eventTemplate>۔

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
hno: تسیں<sentenceCollectorLinkAdd>تھوڑی تعداد بچ بھی جملے بَہ ہکدے ہو</sentenceCollectorLinkAdd>، یا تسیں <bulkImportDocsLink>Github دا استعمال کردیاں ہویاں خاصی درآمد بھی کر سکدے ہو</bulkImportDocsLink>۔ یاد رکھو او جملے <licenseLink>CC0 (یا عوامی ڈومین) </licenseLink>ہونڑے چاہیدے ہن، یا تسیں خود بھی لکھ سکدے ہو۔

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
hno: تسیں وکی پیڈیا تو مختصر جملے حاصل کرنا واسطے <scraperLink>جملے نکھیڑنا والا</scraperLink>دا استعمال کر سکدے ہو۔

source: You check whether the transcription matches the audio
hno: تسیں چیک کرو کہ ٹرانسکرپشن آڈیو نال ملدی اے

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
hno: تسیں ویب سائٹ شامل کر سگدے ہو، مثال دے طور تے "کامن وائس"۔ https://commonvoice.mozilla.org/

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
hno: تسیں اکیڈمک حوالہ دینڑا دا انداز استعمال کر سکدے ہو، جسطرح کہ ہارورڈ اسٹائل "موزیلا (2021) کامن وائس۔https://commonvoice.mozilla.org/ تے دستیاب ہے: 15 ستمبر 2021)"

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
hno: تسیں پیغام پچانڑ واسطے سوشل میڈیا پلیٹ فارمز دا استعمال کر سکدے ہو۔ او پوسٹس شیئرکرو جڑی دسے کہ ایہ کیاں ضروری اہم ہے، ہور دوسرے لوگاں نال رابطے بچ رہو مسائل دے بارے گل کردیاں ہویاں جسطرح کہ زبان دے حقوق، AI آواز، ٹیکنالوجی بچ تعصپ۔ مزید نصیحت دکھو <campaignLink>سماجی مہم چلینڑا تے، بشمول مواد جڑھا دوبارا تسیں استعمال کر سکدے ہو</campaignLink>۔

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
hno: تساں کوئی بھی زباناں نیں چنڑیاں دیاں۔برائے مہربانی زباناں دے انتخاب واسطے اپنڑی <profileLink>پروفائل</profileLink>تے جُلو۔

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
hno: تسیں اس صفحے دے جمع دی حد تے پہنچ گے ہو۔ مہربانی نال { $retryLimit } مِنٹاں آستے انتظار کرو ہور جملہ جمع کرالنا تو پہلے۔ تسدی برداشت دا شکریہ!

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
hno: تسیں اس صفحے دے جمع دی حد تے پہنچ گے ہو۔ مہربانی نال { $retryLimit } سیکنڈاں آستے انتظار کرو ہور جملہ جمع کرالنا تو پہلے۔ تسدی برداشت دا شکریہ!

source: You have unsaved changes on this page. If you change the locale, your changes will not be saved. Are you sure you want to change the locale?
hno: اس صفحہ تے تساں جڑیاں تبدیلیاں کیتیاں محفوظ نیں ہویّاں۔ اگر تسیں اس لوکل (عوامی) کو تبدیل کرسو، تُسدیّاں تبدیلیاں محفوظ نہ ہوسّن۔ واقعی تسیں اس لوکل کو تبدیل کرّن لگیو؟

source: You have unsaved changes on this page. If you leave this page, your changes will not be saved. Are you sure you want to leave this page?
hno: اس صفحہ تے تساں جڑیاں تبدیلیاں کیتیاں محفوظ نیں ہویّاں۔ اگر تسیں اس صفحہ کو چھوڑسو، تُسدیّاں تبدیلیاں محفوظ نہ ہوسّن۔ واقعی تسیں اس صفحہ کو چھوڑّن لگیو؟

source: You must allow microphone access.
hno: تسیں ضرور مائیکروفون کو رسائی دی اجازت دیو۔

source: You need to be able to hear every word of the recording. We want machine learning algorithms to be able to handle a variety of background noise, and even relatively loud noises or quiet background music can be accepted provided that they don’t prevent you from hearing the entirety of the text. Crackles or ‘breaking up’ that prevent you hearing the text means you should reject the clip.
hno: تُساں کو اس قابل ہونڑا چاہے دا کہ ریکاڈنگ دے ہر لفظ کو سنڑو۔ اسیں مشین لرننگ الگورتھم کو اس قابل چہندے ہاں کو او پچھا دی مختلف آوازاں کو ہینڈل کرا، ہور زرا اُچیاں آوازاں یا آہستہ نال پچھا چلنا آلے گانڑے بھی قبول کر ہکدا ہوے لیکن شرط اے ہے کہ او تُساں کو پورا مواد سنڑنا کو نہ روکا۔ کریکلز یا ’بریک اپ‘ جِڑّا تُساں کو مواد سنڑنا تو روکا اس دا مطلب ہے کہ تساں کو او کلپ مسترد کر چھڑنا چاہی دا ہے۔

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
hno: تُسیں جسطرح لفظاں دا تلفظ کردے ہو او تُسدا لہجہ ہے۔ تُسیں کتھا رہیے دے او، تُسیں ہور کیڑیاں زباناں بولدے او تے مُچ سارے عوامل نال اے (لہجہ) بنڑدا ہے۔ تُسیں کوئی بھی معلومات جس کو تُسیں اہم سمجدے ہو، اِتھا دس ہکدے او۔

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
hno: تسدیاں گمنام وائس ریکاڈنگ کامن وائس ڈیٹا سیٹ بچ رہسن۔ جدوں تُساں اپنڑی پروفائل ڈیلیٹ کر چُھڑی تے تُسیں اپنڑی ریکاڈنگ کو ڈیٹا سیٹ بچو ہٹینڑا دی درخواست نہ جمع کرال ہکسو۔

source: Your daily goal has been created
hno: تسدے روز دا مقصد بنڑ گیا ہے

source: Your dataset is downloading!
hno: تُسدا ڈیٹا سیٹ ڈاؤنلوڈ ہو رہیا ہے!

source: Your download has started.
hno: تسدی ڈاؤن لوڈ شروع ہو گئی ہے۔

source: You’re contributing to a target segment
hno: تسیں ہک ہدف دے حصے بچ مدد کر رہ ہو

source: You’re contributing to our first target segment
hno: تسیں اسدے ہدف دے پہلے حصے بچ مدد کر رہ ہو

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
hno: تسیں فلحال کامن وائس بارے ای میلاں موصول کرنا کو<bold>ناں</bold> تیار ہو جڑیاں مقاصد دی یادھانی، مڑی پیشرفت بارے آگاہی ہور خبرنامے ہارے ہن۔

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
hno: تسیں فلحال کامن وائس بارے ای میلاں موصول کرنا کو تیار ہو جڑیاں مقاصد دی یادھانی، مڑی پیشرفت بارے آگاہی ہور خبرنامے ہارے ہن۔

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
hno: تُسیں مچ جلدی کردیو۔ براہ مہربانی جملے دے جائزے واسطے تھوڑا وقت لاؤ نال اس گلا کو یقینی بنڑاؤ کہ اے ٹھیک ہے۔

source: You're helping Common Voice reach our daily sentence goals!
hno: تسیں اسدے روز دے جملیاں دا ہدف پورا کرنا واسطے مدد کر رے ہو۔

source: Your email address
hno: تسدا ای میل ایڈرس

source: You respond or reply to it as naturally as you can
hno: تُسدا جواب جتنا ہو سکا قدرتی ہووا

source: Your files are being assembled. Please check again later.
hno: تُسدیاں فائلاں جُڑ رہیاں ہن۔ مہربانی نال بعد بچ فر دِخیو۔

source: Your Languages
hno: تسدیاں زباناں

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
hno: تسدی زبان دے لہجہ بچ کلپس مُک ہکدے ہن! اگر تسیں آرام نال ہو، تے تسیں دوئے جملے اپنڑی زبان بچ دکھنڑا واسطے اپنڑی ترتیب بدلا ہکدے ہو۔

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
hno: ہو سکدا ہے تسدی زبان دا لہجہ جملیاں تو باہر ہوا۔ اگر تسں’ سکھی ہو، تسں دوسرے جملے اپنڑی زبان بچ دکھنا واسطے اپنڑی ترتیب بدلا ہکدے ہو۔

source: Your username and email will not be associated with the published data.
hno: تُسدا استعمال دا ناں ہور ای میل چھاپے دے ڈیٹا نال نہ جُوڑی جُلسی۔

source: Your weekly goal has been created
hno: تسدے ہفتہ وار مقصد بنڑ گیا ہے

source: You should receive an email shortly explaining the steps to get your language added to Common Voice
hno: تساں جلدی ہک ای میل وصول کرنی چاہیدی اے جس بچ کامن وائس بچ زبان شامل کرنا دے مراحلیاں بارے تفصیل ہوسی

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
hno: تساں کامن وائس کو <goalPercentage></goalPercentage>اسدے روز دے{ $goalValue }ریکاڈنگ دے ہدف تے { $goalValue }پہنچنڑا بچ مدد کیتی ہے۔

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
hno: تساں کامن وائس کو <goalPercentage></goalPercentage>اسدے روز دے{ $goalValue }تصدیقی ہدف تے { $goalValue }پہنچنڑا بچ مدد کیتی ہے۔

source: You've successfully signed up for contributing to { $language }. Thank you.
hno: تُساں{ $language }بچ حصہ بینڑا واسطے کامیابی نال سائن اپ کیتا۔ شکریہ

source: You want to join the Common Voice mailing list
hno: تسیں کامن وائس دی ای میل والی لسٹ نال جڑنا چہندے ہو۔

source: You write down what you hear in the audio clips
hno: جڑّا تساں آڈیو کلپس بچ سنڑیا اوہی لکھو

source: Zaza
hno: زازا

source: Zip #{ $offset } of { $total }
hno: { $total } بچو Zip #{ $offset }

source: Zulu
hno: زولو

source: account recovery key
hno: کھاتہ بحالی دی چابی

source: add-on
hno: ایڈ آن

source: alternate text
hno: متبادل تحریر

source: attack
hno: حملہ

source: attacker
hno: حملہ آور

source: Attack Site
hno: حملہ آلی سائٹ

source: attendee
hno: شرکتی

source: authenticate
hno: تصدیق دیو

source: authenticated
hno: تصدیق کیتا دا

source: authentication code
hno: تصدیق کرنا دا نمبر

source: autoplay
hno: آٹو پلے

source: backup authentication code
hno: بیک اپ تصدیقی نمبر

source: bookmark
hno: بُک مارک

source: breakpoint
hno: بریک پوائنٹ

source: Bug report
hno: خرابی دی رپوٹ

source: certificate authority
hno: سرٹیفکیٹ اتھارٹی

source: cipher
hno: خفیہ کوڈ

source: clipboard
hno: کلپ بورڑ

source: colorway
hno: کلروے

source: confirmation code
hno: تصدیقی کوڈ

source: context
hno: حوالہ

source: cookie banner
hno: کوکی بینر

source: corrupt
hno: خراب

source: corrupted
hno: خراب ہوئے دا

source: crash
hno: کریش

source: cross-site tracking cookie
hno: کراس سائٹ ٹریکنگ کوکی

source: cryptominer
hno: کرپٹو مائنر

source: cryptomining
hno: کرپٹو مائنیگ

source: debug
hno: ڈیبگ
